Here are the results from a local terraform test referencing the latest SDK.  Tests include:
terraform init
terraform apply
terraform destroy
terraform import

```
jbenneto@MacBookPro fra-vpc-terraform % terraform init
Initializing the backend...
Initializing provider plugins...
- Reusing previous version of ibm-cloud/ibm from the dependency lock file
- Using previously-installed ibm-cloud/ibm v0.0.4

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
jbenneto@MacBookPro fra-vpc-terraform % terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ibm_hpcs.hpcs will be created
  + resource "ibm_hpcs" "hpcs" {
      + created_at            = (known after apply)
      + created_by            = (known after apply)
      + crn                   = (known after apply)
      + dashboard_url         = (known after apply)
      + deleted_at            = (known after apply)
      + deleted_by            = (known after apply)
      + extensions            = (known after apply)
      + guid                  = (known after apply)
      + hsm_info              = (known after apply)
      + id                    = (known after apply)
      + location              = "eu-de"
      + name                  = "jb-fra-terraform-std5"
      + plan                  = "standard"
      + resource_aliases_url  = (known after apply)
      + resource_bindings_url = (known after apply)
      + resource_group_id     = (known after apply)
      + resource_keys_url     = (known after apply)
      + restored_at           = (known after apply)
      + restored_by           = (known after apply)
      + revocation_threshold  = 1
      + scheduled_reclaim_at  = (known after apply)
      + scheduled_reclaim_by  = (known after apply)
      + service               = "hs-crypto"
      + service_endpoints     = (known after apply)
      + signature_threshold   = 1
      + state                 = (known after apply)
      + status                = (known after apply)
      + tags                  = (known after apply)
      + units                 = 2
      + update_at             = (known after apply)
      + update_by             = (known after apply)

      + admins {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + admins {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ibm_hpcs.hpcs: Creating...
ibm_hpcs.hpcs: Still creating... [10s elapsed]
ibm_hpcs.hpcs: Still creating... [20s elapsed]
ibm_hpcs.hpcs: Still creating... [30s elapsed]
ibm_hpcs.hpcs: Still creating... [40s elapsed]
ibm_hpcs.hpcs: Still creating... [50s elapsed]
ibm_hpcs.hpcs: Still creating... [1m0s elapsed]
ibm_hpcs.hpcs: Still creating... [1m10s elapsed]
ibm_hpcs.hpcs: Still creating... [1m20s elapsed]
ibm_hpcs.hpcs: Still creating... [1m30s elapsed]
ibm_hpcs.hpcs: Still creating... [1m40s elapsed]
ibm_hpcs.hpcs: Still creating... [1m50s elapsed]
ibm_hpcs.hpcs: Still creating... [2m0s elapsed]
ibm_hpcs.hpcs: Still creating... [2m10s elapsed]
ibm_hpcs.hpcs: Still creating... [2m20s elapsed]
ibm_hpcs.hpcs: Still creating... [2m30s elapsed]
ibm_hpcs.hpcs: Still creating... [2m40s elapsed]
ibm_hpcs.hpcs: Still creating... [2m50s elapsed]
ibm_hpcs.hpcs: Still creating... [3m0s elapsed]
ibm_hpcs.hpcs: Still creating... [3m10s elapsed]
ibm_hpcs.hpcs: Still creating... [3m20s elapsed]
ibm_hpcs.hpcs: Still creating... [3m30s elapsed]
ibm_hpcs.hpcs: Still creating... [3m40s elapsed]
ibm_hpcs.hpcs: Still creating... [3m50s elapsed]
ibm_hpcs.hpcs: Still creating... [4m0s elapsed]
ibm_hpcs.hpcs: Still creating... [4m10s elapsed]
ibm_hpcs.hpcs: Still creating... [4m20s elapsed]
ibm_hpcs.hpcs: Still creating... [4m30s elapsed]
ibm_hpcs.hpcs: Still creating... [4m40s elapsed]
ibm_hpcs.hpcs: Still creating... [4m50s elapsed]
ibm_hpcs.hpcs: Still creating... [5m0s elapsed]
ibm_hpcs.hpcs: Creation complete after 5m2s [id=crn:v1:bluemix:public:hs-crypto:eu-de:a/c38d685ea5004b07a54b3a3779b34418:15078684-a21e-4ff7-bd74-b1d02ad986c9::]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
jbenneto@MacBookPro fra-vpc-terraform % terraform show
# ibm_hpcs.hpcs:
resource "ibm_hpcs" "hpcs" {
    created_at            = "2025-03-06T13:49:54.827Z"
    created_by            = "IBMid-2700045FAW"
    crn                   = "crn:v1:bluemix:public:hs-crypto:eu-de:a/c38d685ea5004b07a54b3a3779b34418:15078684-a21e-4ff7-bd74-b1d02ad986c9::"
    dashboard_url         = "https://cloud.ibm.com/hs-crypto/crn%3Av1%3Abluemix%3Apublic%3Ahs-crypto%3Aeu-de%3Aa%2Fc38d685ea5004b07a54b3a3779b34418%3A15078684-a21e-4ff7-bd74-b1d02ad986c9%3A%3A"
    deleted_by            = null
    extensions            = {
        "allowed_network"         = "public-and-private"
        "endpoints.private"       = "https://15078684-a21e-4ff7-bd74-b1d02ad986c9.api.private.eu-de.hs-crypto.appdomain.cloud"
        "endpoints.privateGrep11" = "https://15078684-a21e-4ff7-bd74-b1d02ad986c9.ep11.private.eu-de.hs-crypto.appdomain.cloud"
        "endpoints.public"        = "https://15078684-a21e-4ff7-bd74-b1d02ad986c9.api.eu-de.hs-crypto.appdomain.cloud"
        "endpoints.publicGrep11"  = "https://15078684-a21e-4ff7-bd74-b1d02ad986c9.ep11.eu-de.hs-crypto.appdomain.cloud"
    }
    guid                  = "15078684-a21e-4ff7-bd74-b1d02ad986c9"
    hsm_info              = [
        {
            admins               = [
                {
                    name = "admin1"
                    ski  = "189f151cd60f40f64bc1c15412edd8be6f9ec20e38b2765c8a781b858f121f20"
                },
                {
                    name = "admin2"
                    ski  = "65adefc9885606e4c13fddbf931d8e2b7193fad44b66be99b25a8be426b25401"
                },
            ]
            current_mk_status    = "Valid"
            current_mkvp         = "a35260ad70cb89db2cd64a660b24c4db707109aedc7ce5d4588702f400000000"
            hsm_id               = "0e3dc0b4-5d55-4f51-5f8a-2b1aa5098dd0"
            hsm_location         = "[eu-de].[AZ3-fra3-qz1-sr3-rk008-a03].[04].[37]"
            hsm_type             = "operational"
            new_mk_status        = "Empty"
            new_mkvp             = "0000000000000000000000000000000000000000000000000000000000000000"
            revocation_threshold = 1
            signature_threshold  = 1
        },
        {
            admins               = [
                {
                    name = "admin1"
                    ski  = "189f151cd60f40f64bc1c15412edd8be6f9ec20e38b2765c8a781b858f121f20"
                },
                {
                    name = "admin2"
                    ski  = "65adefc9885606e4c13fddbf931d8e2b7193fad44b66be99b25a8be426b25401"
                },
            ]
            current_mk_status    = "Valid"
            current_mkvp         = "a35260ad70cb89db2cd64a660b24c4db707109aedc7ce5d4588702f400000000"
            hsm_id               = "1bc94404-5960-47c2-65d0-e411e90666d5"
            hsm_location         = "[eu-de].[AZ1-fra1-qz1-sr6-rk156-a01].[00].[33]"
            hsm_type             = "operational"
            new_mk_status        = "Empty"
            new_mkvp             = "0000000000000000000000000000000000000000000000000000000000000000"
            revocation_threshold = 1
            signature_threshold  = 1
        },
        {
            admins               = [
                {
                    name = "admin1"
                    ski  = "189f151cd60f40f64bc1c15412edd8be6f9ec20e38b2765c8a781b858f121f20"
                },
                {
                    name = "admin2"
                    ski  = "65adefc9885606e4c13fddbf931d8e2b7193fad44b66be99b25a8be426b25401"
                },
            ]
            current_mk_status    = "Valid"
            current_mkvp         = "a35260ad70cb89db2cd64a660b24c4db707109aedc7ce5d4588702f400000000"
            hsm_id               = "137c44b4-40ac-43b9-5ad0-a3501434fdb8"
            hsm_location         = "[eu-de].[AZ1-fra1-qz1-sr6-rk156-a01].[00].[09]"
            hsm_type             = "recovery"
            new_mk_status        = "Empty"
            new_mkvp             = "0000000000000000000000000000000000000000000000000000000000000000"
            revocation_threshold = 1
            signature_threshold  = 1
        },
        {
            admins               = [
                {
                    name = "admin1"
                    ski  = "189f151cd60f40f64bc1c15412edd8be6f9ec20e38b2765c8a781b858f121f20"
                },
                {
                    name = "admin2"
                    ski  = "65adefc9885606e4c13fddbf931d8e2b7193fad44b66be99b25a8be426b25401"
                },
            ]
            current_mk_status    = "Valid"
            current_mkvp         = "a35260ad70cb89db2cd64a660b24c4db707109aedc7ce5d4588702f4566f85a7"
            hsm_id               = "0d329ed8-bbf3-40b3-7fa7-ccd1f0ad077d"
            hsm_location         = "[eu-es].[AZ1-mad1-qz1-sr1-rk012-a01].[00].[55]"
            hsm_type             = "recovery"
            new_mk_status        = "Empty"
            new_mkvp             = "0000000000000000000000000000000000000000000000000000000000000000"
            revocation_threshold = 1
            signature_threshold  = 1
        },
    ]
    id                    = "crn:v1:bluemix:public:hs-crypto:eu-de:a/c38d685ea5004b07a54b3a3779b34418:15078684-a21e-4ff7-bd74-b1d02ad986c9::"
    location              = "eu-de"
    name                  = "jb-fra-terraform-std5"
    plan                  = "standard"
    resource_aliases_url  = "/v2/resource_instances/15078684-a21e-4ff7-bd74-b1d02ad986c9/resource_aliases"
    resource_bindings_url = "/v2/resource_instances/15078684-a21e-4ff7-bd74-b1d02ad986c9/resource_bindings"
    resource_group_id     = "d31d4bcd48bb4ec3a7d8c5ab01c041e7"
    resource_keys_url     = "/v2/resource_instances/15078684-a21e-4ff7-bd74-b1d02ad986c9/resource_keys"
    restored_by           = null
    revocation_threshold  = 1
    scheduled_reclaim_by  = null
    service               = "hs-crypto"
    service_endpoints     = "public-and-private"
    signature_threshold   = 1
    state                 = "active"
    status                = "active"
    tags                  = []
    units                 = 2
    update_at             = "2025-03-06T13:51:25.002Z"
    update_by             = null

    admins {
      # At least one attribute in this block is (or was) sensitive,
      # so its contents will not be displayed.
    }
    admins {
      # At least one attribute in this block is (or was) sensitive,
      # so its contents will not be displayed.
    }
}
jbenneto@MacBookPro fra-vpc-terraform % terraform destroy
ibm_hpcs.hpcs: Refreshing state... [id=crn:v1:bluemix:public:hs-crypto:eu-de:a/c38d685ea5004b07a54b3a3779b34418:15078684-a21e-4ff7-bd74-b1d02ad986c9::]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # ibm_hpcs.hpcs will be destroyed
  - resource "ibm_hpcs" "hpcs" {
      - created_at            = "2025-03-06T13:49:54.827Z" -> null
      - created_by            = "IBMid-2700045FAW" -> null
      - crn                   = "crn:v1:bluemix:public:hs-crypto:eu-de:a/c38d685ea5004b07a54b3a3779b34418:15078684-a21e-4ff7-bd74-b1d02ad986c9::" -> null
      - dashboard_url         = "https://cloud.ibm.com/hs-crypto/crn%3Av1%3Abluemix%3Apublic%3Ahs-crypto%3Aeu-de%3Aa%2Fc38d685ea5004b07a54b3a3779b34418%3A15078684-a21e-4ff7-bd74-b1d02ad986c9%3A%3A" -> null
      - extensions            = {
          - "allowed_network"         = "public-and-private"
          - "endpoints.private"       = "https://15078684-a21e-4ff7-bd74-b1d02ad986c9.api.private.eu-de.hs-crypto.appdomain.cloud"
          - "endpoints.privateGrep11" = "https://15078684-a21e-4ff7-bd74-b1d02ad986c9.ep11.private.eu-de.hs-crypto.appdomain.cloud"
          - "endpoints.public"        = "https://15078684-a21e-4ff7-bd74-b1d02ad986c9.api.eu-de.hs-crypto.appdomain.cloud"
          - "endpoints.publicGrep11"  = "https://15078684-a21e-4ff7-bd74-b1d02ad986c9.ep11.eu-de.hs-crypto.appdomain.cloud"
        } -> null
      - guid                  = "15078684-a21e-4ff7-bd74-b1d02ad986c9" -> null
      - hsm_info              = [
          - {
              - admins               = [
                  - {
                      - name = "admin1"
                      - ski  = "189f151cd60f40f64bc1c15412edd8be6f9ec20e38b2765c8a781b858f121f20"
                    },
                  - {
                      - name = "admin2"
                      - ski  = "65adefc9885606e4c13fddbf931d8e2b7193fad44b66be99b25a8be426b25401"
                    },
                ]
              - current_mk_status    = "Valid"
              - current_mkvp         = "a35260ad70cb89db2cd64a660b24c4db707109aedc7ce5d4588702f400000000"
              - hsm_id               = "0e3dc0b4-5d55-4f51-5f8a-2b1aa5098dd0"
              - hsm_location         = "[eu-de].[AZ3-fra3-qz1-sr3-rk008-a03].[04].[37]"
              - hsm_type             = "operational"
              - new_mk_status        = "Empty"
              - new_mkvp             = "0000000000000000000000000000000000000000000000000000000000000000"
              - revocation_threshold = 1
              - signature_threshold  = 1
            },
          - {
              - admins               = [
                  - {
                      - name = "admin1"
                      - ski  = "189f151cd60f40f64bc1c15412edd8be6f9ec20e38b2765c8a781b858f121f20"
                    },
                  - {
                      - name = "admin2"
                      - ski  = "65adefc9885606e4c13fddbf931d8e2b7193fad44b66be99b25a8be426b25401"
                    },
                ]
              - current_mk_status    = "Valid"
              - current_mkvp         = "a35260ad70cb89db2cd64a660b24c4db707109aedc7ce5d4588702f400000000"
              - hsm_id               = "1bc94404-5960-47c2-65d0-e411e90666d5"
              - hsm_location         = "[eu-de].[AZ1-fra1-qz1-sr6-rk156-a01].[00].[33]"
              - hsm_type             = "operational"
              - new_mk_status        = "Empty"
              - new_mkvp             = "0000000000000000000000000000000000000000000000000000000000000000"
              - revocation_threshold = 1
              - signature_threshold  = 1
            },
          - {
              - admins               = [
                  - {
                      - name = "admin1"
                      - ski  = "189f151cd60f40f64bc1c15412edd8be6f9ec20e38b2765c8a781b858f121f20"
                    },
                  - {
                      - name = "admin2"
                      - ski  = "65adefc9885606e4c13fddbf931d8e2b7193fad44b66be99b25a8be426b25401"
                    },
                ]
              - current_mk_status    = "Valid"
              - current_mkvp         = "a35260ad70cb89db2cd64a660b24c4db707109aedc7ce5d4588702f400000000"
              - hsm_id               = "137c44b4-40ac-43b9-5ad0-a3501434fdb8"
              - hsm_location         = "[eu-de].[AZ1-fra1-qz1-sr6-rk156-a01].[00].[09]"
              - hsm_type             = "recovery"
              - new_mk_status        = "Empty"
              - new_mkvp             = "0000000000000000000000000000000000000000000000000000000000000000"
              - revocation_threshold = 1
              - signature_threshold  = 1
            },
          - {
              - admins               = [
                  - {
                      - name = "admin1"
                      - ski  = "189f151cd60f40f64bc1c15412edd8be6f9ec20e38b2765c8a781b858f121f20"
                    },
                  - {
                      - name = "admin2"
                      - ski  = "65adefc9885606e4c13fddbf931d8e2b7193fad44b66be99b25a8be426b25401"
                    },
                ]
              - current_mk_status    = "Valid"
              - current_mkvp         = "a35260ad70cb89db2cd64a660b24c4db707109aedc7ce5d4588702f4566f85a7"
              - hsm_id               = "0d329ed8-bbf3-40b3-7fa7-ccd1f0ad077d"
              - hsm_location         = "[eu-es].[AZ1-mad1-qz1-sr1-rk012-a01].[00].[55]"
              - hsm_type             = "recovery"
              - new_mk_status        = "Empty"
              - new_mkvp             = "0000000000000000000000000000000000000000000000000000000000000000"
              - revocation_threshold = 1
              - signature_threshold  = 1
            },
        ] -> null
      - id                    = "crn:v1:bluemix:public:hs-crypto:eu-de:a/c38d685ea5004b07a54b3a3779b34418:15078684-a21e-4ff7-bd74-b1d02ad986c9::" -> null
      - location              = "eu-de" -> null
      - name                  = "jb-fra-terraform-std5" -> null
      - plan                  = "standard" -> null
      - resource_aliases_url  = "/v2/resource_instances/15078684-a21e-4ff7-bd74-b1d02ad986c9/resource_aliases" -> null
      - resource_bindings_url = "/v2/resource_instances/15078684-a21e-4ff7-bd74-b1d02ad986c9/resource_bindings" -> null
      - resource_group_id     = "d31d4bcd48bb4ec3a7d8c5ab01c041e7" -> null
      - resource_keys_url     = "/v2/resource_instances/15078684-a21e-4ff7-bd74-b1d02ad986c9/resource_keys" -> null
      - revocation_threshold  = 1 -> null
      - service               = "hs-crypto" -> null
      - service_endpoints     = "public-and-private" -> null
      - signature_threshold   = 1 -> null
      - state                 = "active" -> null
      - status                = "active" -> null
      - tags                  = [] -> null
      - units                 = 2 -> null
      - update_at             = "2025-03-06T13:51:25.002Z" -> null
        # (4 unchanged attributes hidden)

      - admins {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - admins {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

Plan: 0 to add, 0 to change, 1 to destroy.

Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

ibm_hpcs.hpcs: Destroying... [id=crn:v1:bluemix:public:hs-crypto:eu-de:a/c38d685ea5004b07a54b3a3779b34418:15078684-a21e-4ff7-bd74-b1d02ad986c9::]
ibm_hpcs.hpcs: Still destroying... [id=crn:v1:bluemix:public:hs-crypto:eu-de:a...15078684-a21e-4ff7-bd74-b1d02ad986c9::, 10s elapsed]
ibm_hpcs.hpcs: Still destroying... [id=crn:v1:bluemix:public:hs-crypto:eu-de:a...15078684-a21e-4ff7-bd74-b1d02ad986c9::, 20s elapsed]
ibm_hpcs.hpcs: Still destroying... [id=crn:v1:bluemix:public:hs-crypto:eu-de:a...15078684-a21e-4ff7-bd74-b1d02ad986c9::, 30s elapsed]
ibm_hpcs.hpcs: Still destroying... [id=crn:v1:bluemix:public:hs-crypto:eu-de:a...15078684-a21e-4ff7-bd74-b1d02ad986c9::, 40s elapsed]
ibm_hpcs.hpcs: Still destroying... [id=crn:v1:bluemix:public:hs-crypto:eu-de:a...15078684-a21e-4ff7-bd74-b1d02ad986c9::, 50s elapsed]
ibm_hpcs.hpcs: Still destroying... [id=crn:v1:bluemix:public:hs-crypto:eu-de:a...15078684-a21e-4ff7-bd74-b1d02ad986c9::, 1m0s elapsed]
ibm_hpcs.hpcs: Still destroying... [id=crn:v1:bluemix:public:hs-crypto:eu-de:a...15078684-a21e-4ff7-bd74-b1d02ad986c9::, 1m10s elapsed]
ibm_hpcs.hpcs: Still destroying... [id=crn:v1:bluemix:public:hs-crypto:eu-de:a...15078684-a21e-4ff7-bd74-b1d02ad986c9::, 1m20s elapsed]
ibm_hpcs.hpcs: Still destroying... [id=crn:v1:bluemix:public:hs-crypto:eu-de:a...15078684-a21e-4ff7-bd74-b1d02ad986c9::, 1m30s elapsed]
ibm_hpcs.hpcs: Still destroying... [id=crn:v1:bluemix:public:hs-crypto:eu-de:a...15078684-a21e-4ff7-bd74-b1d02ad986c9::, 1m40s elapsed]
ibm_hpcs.hpcs: Still destroying... [id=crn:v1:bluemix:public:hs-crypto:eu-de:a...15078684-a21e-4ff7-bd74-b1d02ad986c9::, 1m50s elapsed]
ibm_hpcs.hpcs: Still destroying... [id=crn:v1:bluemix:public:hs-crypto:eu-de:a...15078684-a21e-4ff7-bd74-b1d02ad986c9::, 2m0s elapsed]
ibm_hpcs.hpcs: Still destroying... [id=crn:v1:bluemix:public:hs-crypto:eu-de:a...15078684-a21e-4ff7-bd74-b1d02ad986c9::, 2m10s elapsed]
ibm_hpcs.hpcs: Still destroying... [id=crn:v1:bluemix:public:hs-crypto:eu-de:a...15078684-a21e-4ff7-bd74-b1d02ad986c9::, 2m20s elapsed]
ibm_hpcs.hpcs: Still destroying... [id=crn:v1:bluemix:public:hs-crypto:eu-de:a...15078684-a21e-4ff7-bd74-b1d02ad986c9::, 2m30s elapsed]
ibm_hpcs.hpcs: Destruction complete after 2m31s

Destroy complete! Resources: 1 destroyed.
jbenneto@MacBookPro fra-vpc-terraform % terraform show   
The state file is empty. No resources are represented.
jbenneto@MacBookPro fra-vpc-terraform % terraform import ibm_hpcs.hpcs crn:v1:bluemix:public:hs-crypto:eu-de:a/c38d685ea5004b07a54b3a3779b34418:36d26a90-fb14-4cc6-a91a-ff5741fb39c4::
ibm_hpcs.hpcs: Importing from ID "crn:v1:bluemix:public:hs-crypto:eu-de:a/c38d685ea5004b07a54b3a3779b34418:36d26a90-fb14-4cc6-a91a-ff5741fb39c4::"...
ibm_hpcs.hpcs: Import prepared!
  Prepared ibm_hpcs for import
ibm_hpcs.hpcs: Refreshing state... [id=crn:v1:bluemix:public:hs-crypto:eu-de:a/c38d685ea5004b07a54b3a3779b34418:36d26a90-fb14-4cc6-a91a-ff5741fb39c4::]

Import successful!

The resources that were imported are shown above. These resources are now in
your Terraform state and will henceforth be managed by Terraform.

jbenneto@MacBookPro fra-vpc-terraform % terraform show                                                                                                                                
# ibm_hpcs.hpcs:
resource "ibm_hpcs" "hpcs" {
    created_at            = "2024-10-16T13:16:13.754Z"
    created_by            = "IBMid-2700045FAW"
    crn                   = "crn:v1:bluemix:public:hs-crypto:eu-de:a/c38d685ea5004b07a54b3a3779b34418:36d26a90-fb14-4cc6-a91a-ff5741fb39c4::"
    dashboard_url         = "https://cloud.ibm.com/hs-crypto/crn%3Av1%3Abluemix%3Apublic%3Ahs-crypto%3Aeu-de%3Aa%2Fc38d685ea5004b07a54b3a3779b34418%3A36d26a90-fb14-4cc6-a91a-ff5741fb39c4%3A%3A"
    deleted_by            = null
    extensions            = {
        "allowed_network"         = "public-and-private"
        "endpoints.private"       = "https://36d26a90-fb14-4cc6-a91a-ff5741fb39c4.api.private.eu-de.hs-crypto.appdomain.cloud"
        "endpoints.privateGrep11" = "https://36d26a90-fb14-4cc6-a91a-ff5741fb39c4.ep11.private.eu-de.hs-crypto.appdomain.cloud"
        "endpoints.public"        = "https://36d26a90-fb14-4cc6-a91a-ff5741fb39c4.api.eu-de.hs-crypto.appdomain.cloud"
        "endpoints.publicGrep11"  = "https://36d26a90-fb14-4cc6-a91a-ff5741fb39c4.ep11.eu-de.hs-crypto.appdomain.cloud"
    }
    guid                  = "36d26a90-fb14-4cc6-a91a-ff5741fb39c4"
    hsm_info              = [
        {
            admins               = [
                {
                    name = "admin1"
                    ski  = "189f151cd60f40f64bc1c15412edd8be6f9ec20e38b2765c8a781b858f121f20"
                },
                {
                    name = "admin2"
                    ski  = "65adefc9885606e4c13fddbf931d8e2b7193fad44b66be99b25a8be426b25401"
                },
            ]
            current_mk_status    = "Valid"
            current_mkvp         = "8775bab535f631992ee57a419b6ab1af06a3d9e34eac69b1eac4c2b900000000"
            hsm_id               = "4715c76e-3b3b-46e9-77fc-19f42754cf1e"
            hsm_location         = "[eu-de].[AZ2-fra2-qz1-sr3-rk007-a04].[06].[03]"
            hsm_type             = "operational"
            new_mk_status        = "Empty"
            new_mkvp             = "0000000000000000000000000000000000000000000000000000000000000000"
            revocation_threshold = 1
            signature_threshold  = 1
        },
        {
            admins               = [
                {
                    name = "admin1"
                    ski  = "189f151cd60f40f64bc1c15412edd8be6f9ec20e38b2765c8a781b858f121f20"
                },
                {
                    name = "admin2"
                    ski  = "65adefc9885606e4c13fddbf931d8e2b7193fad44b66be99b25a8be426b25401"
                },
            ]
            current_mk_status    = "Valid"
            current_mkvp         = "8775bab535f631992ee57a419b6ab1af06a3d9e34eac69b1eac4c2b900000000"
            hsm_id               = "0bf585ce-38d1-42a3-7539-7bebacd0e559"
            hsm_location         = "[eu-de].[AZ3-fra3-qz1-sr3-rk008-a04].[06].[02]"
            hsm_type             = "operational"
            new_mk_status        = "Empty"
            new_mkvp             = "0000000000000000000000000000000000000000000000000000000000000000"
            revocation_threshold = 1
            signature_threshold  = 1
        },
        {
            admins               = [
                {
                    name = "admin1"
                    ski  = "189f151cd60f40f64bc1c15412edd8be6f9ec20e38b2765c8a781b858f121f20"
                },
                {
                    name = "admin2"
                    ski  = "65adefc9885606e4c13fddbf931d8e2b7193fad44b66be99b25a8be426b25401"
                },
            ]
            current_mk_status    = "Valid"
            current_mkvp         = "8775bab535f631992ee57a419b6ab1af06a3d9e34eac69b1eac4c2b900000000"
            hsm_id               = "04f40bed-8093-4c4f-78d5-b4b305aa8e13"
            hsm_location         = "[eu-de].[AZ2-fra2-qz1-sr3-rk007-a04].[06].[24]"
            hsm_type             = "recovery"
            new_mk_status        = "Empty"
            new_mkvp             = "0000000000000000000000000000000000000000000000000000000000000000"
            revocation_threshold = 1
            signature_threshold  = 1
        },
        {
            admins               = [
                {
                    name = "admin1"
                    ski  = "189f151cd60f40f64bc1c15412edd8be6f9ec20e38b2765c8a781b858f121f20"
                },
                {
                    name = "admin2"
                    ski  = "65adefc9885606e4c13fddbf931d8e2b7193fad44b66be99b25a8be426b25401"
                },
            ]
            current_mk_status    = "Valid"
            current_mkvp         = "8775bab535f631992ee57a419b6ab1af06a3d9e34eac69b1eac4c2b9600aa4db"
            hsm_id               = "17323122-8052-44ef-7abb-25c66670d2ce"
            hsm_location         = "[eu-es].[AZ3-mad3-qz1-sr1-rk012-a01].[02].[15]"
            hsm_type             = "recovery"
            new_mk_status        = "Empty"
            new_mkvp             = "0000000000000000000000000000000000000000000000000000000000000000"
            revocation_threshold = 1
            signature_threshold  = 1
        },
    ]
    id                    = "crn:v1:bluemix:public:hs-crypto:eu-de:a/c38d685ea5004b07a54b3a3779b34418:36d26a90-fb14-4cc6-a91a-ff5741fb39c4::"
    location              = "eu-de"
    name                  = "jb-fra-terraform-std"
    plan                  = "standard"
    resource_aliases_url  = "/v2/resource_instances/36d26a90-fb14-4cc6-a91a-ff5741fb39c4/resource_aliases"
    resource_bindings_url = "/v2/resource_instances/36d26a90-fb14-4cc6-a91a-ff5741fb39c4/resource_bindings"
    resource_group_id     = "d31d4bcd48bb4ec3a7d8c5ab01c041e7"
    resource_keys_url     = "/v2/resource_instances/36d26a90-fb14-4cc6-a91a-ff5741fb39c4/resource_keys"
    restored_by           = null
    scheduled_reclaim_by  = null
    service               = "hs-crypto"
    service_endpoints     = "public-and-private"
    state                 = "active"
    status                = "active"
    tags                  = []
    units                 = 2
    update_at             = "2024-10-16T13:17:13.020Z"
    update_by             = null
}
jbenneto@MacBookPro fra-vpc-terraform %
```